Revit 2027 API
ViewSchedule.GetValidCategoriesForSchedule Method
 Gets a list of categories that can be used for a regular schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetValidCategoriesForSchedule()
Public Shared Function GetValidCategoriesForSchedule As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetValidCategoriesForSchedule()
static member GetValidCategoriesForSchedule : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The IDs of all valid categories.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace